FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/pio/pio_samv71n20.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71N20_PIO_
#define _SAMV71N20_PIO_

#define PIO_PA20                     ( 1u << 0 )  /**< \brief Pin Controlled by PA20 */
#define PIO_PA19                     ( 1u << 1 )  /**< \brief Pin Controlled by PA19 */
#define PIO_PA18                     ( 1u << 2 )  /**< \brief Pin Controlled by PA18 */
#define PIO_PA17                     ( 1u << 3 )  /**< \brief Pin Controlled by PA17 */
#define PIO_PA21                     ( 1u << 4 )  /**< \brief Pin Controlled by PA21 */
#define PIO_PA7                      ( 1u << 5 )  /**< \brief Pin Controlled by PA7 */
#define PIO_PA8                      ( 1u << 6 )  /**< \brief Pin Controlled by PA8 */
#define PIO_PA22                     ( 1u << 7 )  /**< \brief Pin Controlled by PA22 */
#define PIO_PA13                     ( 1u << 8 )  /**< \brief Pin Controlled by PA13 */
#define PIO_PA16                     ( 1u << 9 )  /**< \brief Pin Controlled by PA16 */
#define PIO_PA23                     ( 1u << 10 ) /**< \brief Pin Controlled by PA23 */
#define PIO_PA15                     ( 1u << 11 ) /**< \brief Pin Controlled by PA15 */
#define PIO_PA14                     ( 1u << 12 ) /**< \brief Pin Controlled by PA14 */
#define PIO_PA24                     ( 1u << 13 ) /**< \brief Pin Controlled by PA24 */
#define PIO_PA25                     ( 1u << 14 ) /**< \brief Pin Controlled by PA25 */
#define PIO_PA26                     ( 1u << 15 ) /**< \brief Pin Controlled by PA26 */
#define PIO_PA11                     ( 1u << 16 ) /**< \brief Pin Controlled by PA11 */
#define PIO_PA10                     ( 1u << 17 ) /**< \brief Pin Controlled by PA10 */
#define PIO_PA12                     ( 1u << 18 ) /**< \brief Pin Controlled by PA12 */
#define PIO_PA27                     ( 1u << 19 ) /**< \brief Pin Controlled by PA27 */
#define PIO_PA5                      ( 1u << 20 ) /**< \brief Pin Controlled by PA5 */
#define PIO_PA9                      ( 1u << 21 ) /**< \brief Pin Controlled by PA9 */
#define PIO_PA4                      ( 1u << 22 ) /**< \brief Pin Controlled by PA4 */
#define PIO_PA3                      ( 1u << 23 ) /**< \brief Pin Controlled by PA3 */
#define PIO_PA2                      ( 1u << 24 ) /**< \brief Pin Controlled by PA2 */
#define PIO_PA1                      ( 1u << 25 ) /**< \brief Pin Controlled by PA1 */
#define PIO_PA0                      ( 1u << 26 ) /**< \brief Pin Controlled by PA0 */
#define PIO_PA28                     ( 1u << 27 ) /**< \brief Pin Controlled by PA28 */
#define PIO_PA30                     ( 1u << 29 ) /**< \brief Pin Controlled by PA30 */
#define PIO_PA31                     ( 1u << 30 ) /**< \brief Pin Controlled by PA31 */
#define PIO_PB1                      ( 1u << 0 )  /**< \brief Pin Controlled by PB1 */
#define PIO_PB0                      ( 1u << 1 )  /**< \brief Pin Controlled by PB0 */
#define PIO_PB2                      ( 1u << 2 )  /**< \brief Pin Controlled by PB2 */
#define PIO_PB3                      ( 1u << 3 )  /**< \brief Pin Controlled by PB3 */
#define PIO_PB6                      ( 1u << 4 )  /**< \brief Pin Controlled by PB6 */
#define PIO_PB12                     ( 1u << 5 )  /**< \brief Pin Controlled by PB12 */
#define PIO_PB7                      ( 1u << 6 )  /**< \brief Pin Controlled by PB7 */
#define PIO_PB4                      ( 1u << 7 )  /**< \brief Pin Controlled by PB4 */
#define PIO_PB5                      ( 1u << 8 )  /**< \brief Pin Controlled by PB5 */
#define PIO_PB8                      ( 1u << 9 )  /**< \brief Pin Controlled by PB8 */
#define PIO_PB9                      ( 1u << 10 ) /**< \brief Pin Controlled by PB9 */
#define PIO_PB13                     ( 1u << 11 ) /**< \brief Pin Controlled by PB13 */
#define PIO_PB10                     ( 1u << 12 ) /**< \brief Pin Controlled by PB10 */
#define PIO_PB11                     ( 1u << 13 ) /**< \brief Pin Controlled by PB11 */
#define PIO_PD0                      ( 1u << 0 )  /**< \brief Pin Controlled by PD0 */
#define PIO_PD31                     ( 1u << 1 )  /**< \brief Pin Controlled by PD31 */
#define PIO_PD30                     ( 1u << 2 )  /**< \brief Pin Controlled by PD30 */
#define PIO_PD27                     ( 1u << 3 )  /**< \brief Pin Controlled by PD27 */
#define PIO_PD25                     ( 1u << 4 )  /**< \brief Pin Controlled by PD25 */
#define PIO_PD26                     ( 1u << 5 )  /**< \brief Pin Controlled by PD26 */
#define PIO_PD24                     ( 1u << 6 )  /**< \brief Pin Controlled by PD24 */
#define PIO_PD22                     ( 1u << 8 )  /**< \brief Pin Controlled by PD22 */
#define PIO_PD21                     ( 1u << 9 )  /**< \brief Pin Controlled by PD21 */
#define PIO_PD20                     ( 1u << 10 ) /**< \brief Pin Controlled by PD20 */
#define PIO_PD19                     ( 1u << 11 ) /**< \brief Pin Controlled by PD19 */
#define PIO_PD18                     ( 1u << 12 ) /**< \brief Pin Controlled by PD18 */
#define PIO_PD28                     ( 1u << 13 ) /**< \brief Pin Controlled by PD28 */
#define PIO_PD17                     ( 1u << 14 ) /**< \brief Pin Controlled by PD17 */
#define PIO_PD16                     ( 1u << 15 ) /**< \brief Pin Controlled by PD16 */
#define PIO_PD14                     ( 1u << 16 ) /**< \brief Pin Controlled by PD14 */
#define PIO_PD13                     ( 1u << 17 ) /**< \brief Pin Controlled by PD13 */
#define PIO_PD12                     ( 1u << 18 ) /**< \brief Pin Controlled by PD12 */
#define PIO_PD11                     ( 1u << 19 ) /**< \brief Pin Controlled by PD11 */
#define PIO_PD10                     ( 1u << 20 ) /**< \brief Pin Controlled by PD10 */
#define PIO_PD15                     ( 1u << 21 ) /**< \brief Pin Controlled by PD15 */
#define PIO_PD9                      ( 1u << 23 ) /**< \brief Pin Controlled by PD9 */
#define PIO_PD8                      ( 1u << 24 ) /**< \brief Pin Controlled by PD8 */
#define PIO_PD7                      ( 1u << 25 ) /**< \brief Pin Controlled by PD7 */
#define PIO_PD6                      ( 1u << 26 ) /**< \brief Pin Controlled by PD6 */
#define PIO_PD5                      ( 1u << 27 ) /**< \brief Pin Controlled by PD5 */
#define PIO_PD4                      ( 1u << 28 ) /**< \brief Pin Controlled by PD4 */
#define PIO_PD3                      ( 1u << 29 ) /**< \brief Pin Controlled by PD3 */
#define PIO_PD2                      ( 1u << 30 ) /**< \brief Pin Controlled by PD2 */
#define PIO_PD1                      ( 1u << 31 ) /**< \brief Pin Controlled by PD1 */
/* ========== Pio definition for AFEC0 peripheral ========== */
#define PIO_PD30X1_AFE0_AD0          ( 1u << 30 ) /**< \brief Afec0 signal: AFE0_AD0 */
#define PIO_PA21X1_AFE0_AD1          ( 1u << 21 ) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2          ( 1u << 21 ) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PB0X1_AFE0_AD10          ( 1u << 0 )  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB0X1_RTCOUT0            ( 1u << 0 )  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB3X1_AFE0_AD2           ( 1u << 3 )  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PB3X1_WKUP12             ( 1u << 3 )  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PE5X1_AFE0_AD3           ( 1u << 5 )  /**< \brief Afec0 signal: AFE0_AD3 */
#define PIO_PE4X1_AFE0_AD4           ( 1u << 4 )  /**< \brief Afec0 signal: AFE0_AD4 */
#define PIO_PB2X1_AFE0_AD5           ( 1u << 2 )  /**< \brief Afec0 signal: AFE0_AD5 */
#define PIO_PA17X1_AFE0_AD6          ( 1u << 17 ) /**< \brief Afec0 signal: AFE0_AD6 */
#define PIO_PA18X1_AFE0_AD7          ( 1u << 18 ) /**< \brief Afec0 signal: AFE0_AD7 */
#define PIO_PA19X1_AFE0_AD8          ( 1u << 19 ) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA19X1_WKUP9             ( 1u << 19 ) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA20X1_AFE0_AD9          ( 1u << 20 ) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA20X1_WKUP10            ( 1u << 20 ) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA8B_AFE0_ADTRG          ( 1u << 8 )  /**< \brief Afec0 signal: AFE0_ADTRG */
/* ========== Pio definition for AFEC1 peripheral ========== */
#define PIO_PB1X1_AFE1_AD0           ( 1u << 1 )  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PB1X1_RTCOUT1            ( 1u << 1 )  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PC13X1_AFE1_AD1          ( 1u << 13 ) /**< \brief Afec1 signal: AFE1_AD1 */
#define PIO_PE3X1_AFE1_AD10          ( 1u << 3 )  /**< \brief Afec1 signal: AFE1_AD10 */
#define PIO_PE0X1_AFE1_AD11          ( 1u << 0 )  /**< \brief Afec1 signal: AFE1_AD11 */
#define PIO_PC15X1_AFE1_AD2          ( 1u << 15 ) /**< \brief Afec1 signal: AFE1_AD2 */
#define PIO_PC12X1_AFE1_AD3          ( 1u << 12 ) /**< \brief Afec1 signal: AFE1_AD3 */
#define PIO_PC29X1_AFE1_AD4          ( 1u << 29 ) /**< \brief Afec1 signal: AFE1_AD4 */
#define PIO_PC30X1_AFE1_AD5          ( 1u << 30 ) /**< \brief Afec1 signal: AFE1_AD5 */
#define PIO_PC31X1_AFE1_AD6          ( 1u << 31 ) /**< \brief Afec1 signal: AFE1_AD6 */
#define PIO_PC26X1_AFE1_AD7          ( 1u << 26 ) /**< \brief Afec1 signal: AFE1_AD7 */
#define PIO_PC27X1_AFE1_AD8          ( 1u << 27 ) /**< \brief Afec1 signal: AFE1_AD8 */
#define PIO_PC0X1_AFE1_AD9           ( 1u << 0 )  /**< \brief Afec1 signal: AFE1_AD9 */
#define PIO_PD9C_AFE1_ADTRG          ( 1u << 9 )  /**< \brief Afec1 signal: AFE1_ADTRG */
/* ========== Pio definition for GMAC peripheral ========== */
#define PIO_PD13A_GCOL               ( 1u << 13 ) /**< \brief Gmac signal: GCOL */
#define PIO_PD10A_GCRS               ( 1u << 10 ) /**< \brief Gmac signal: GCRS */
#define PIO_PD8A_GMDC                ( 1u << 8 )  /**< \brief Gmac signal: GMDC */
#define PIO_PD9A_GMDIO               ( 1u << 9 )  /**< \brief Gmac signal: GMDIO */
#define PIO_PD5A_GRX0                ( 1u << 5 )  /**< \brief Gmac signal: GRX0 */
#define PIO_PD6A_GRX1                ( 1u << 6 )  /**< \brief Gmac signal: GRX1 */
#define PIO_PD11A_GRX2               ( 1u << 11 ) /**< \brief Gmac signal: GRX2 */
#define PIO_PD12A_GRX3               ( 1u << 12 ) /**< \brief Gmac signal: GRX3 */
#define PIO_PD14A_GRXCK              ( 1u << 14 ) /**< \brief Gmac signal: GRXCK */
#define PIO_PD4A_GRXDV               ( 1u << 4 )  /**< \brief Gmac signal: GRXDV */
#define PIO_PD7A_GRXER               ( 1u << 7 )  /**< \brief Gmac signal: GRXER */
#define PIO_PB1B_GTSUCOMP            ( 1u << 1 )  /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PB12B_GTSUCOMP           ( 1u << 12 ) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD11C_GTSUCOMP           ( 1u << 11 ) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD20C_GTSUCOMP           ( 1u << 20 ) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD2A_GTX0                ( 1u << 2 )  /**< \brief Gmac signal: GTX0 */
#define PIO_PD3A_GTX1                ( 1u << 3 )  /**< \brief Gmac signal: GTX1 */
#define PIO_PD15A_GTX2               ( 1u << 15 ) /**< \brief Gmac signal: GTX2 */
#define PIO_PD16A_GTX3               ( 1u << 16 ) /**< \brief Gmac signal: GTX3 */
#define PIO_PD0A_GTXCK               ( 1u << 0 )  /**< \brief Gmac signal: GTXCK */
#define PIO_PD1A_GTXEN               ( 1u << 1 )  /**< \brief Gmac signal: GTXEN */
#define PIO_PD17A_GTXER              ( 1u << 17 ) /**< \brief Gmac signal: GTXER */
/* ========== Pio definition for HSMCI peripheral ========== */
#define PIO_PA28C_MCCDA              ( 1u << 28 ) /**< \brief Hsmci signal: MCCDA */
#define PIO_PA25D_MCCK               ( 1u << 25 ) /**< \brief Hsmci signal: MCCK */
#define PIO_PA30C_MCDA0              ( 1u << 30 ) /**< \brief Hsmci signal: MCDA0 */
#define PIO_PA31C_MCDA1              ( 1u << 31 ) /**< \brief Hsmci signal: MCDA1 */
#define PIO_PA26C_MCDA2              ( 1u << 26 ) /**< \brief Hsmci signal: MCDA2 */
#define PIO_PA27C_MCDA3              ( 1u << 27 ) /**< \brief Hsmci signal: MCDA3 */
/* ========== Pio definition for ISI peripheral ========== */
#define PIO_PD22D_ISI_D0             ( 1u << 22 ) /**< \brief Isi signal: ISI_D0 */
#define PIO_PD21D_ISI_D1             ( 1u << 21 ) /**< \brief Isi signal: ISI_D1 */
#define PIO_PD30D_ISI_D10            ( 1u << 30 ) /**< \brief Isi signal: ISI_D10 */
#define PIO_PD31D_ISI_D11            ( 1u << 31 ) /**< \brief Isi signal: ISI_D11 */
#define PIO_PB3D_ISI_D2              ( 1u << 3 )  /**< \brief Isi signal: ISI_D2 */
#define PIO_PA9B_ISI_D3              ( 1u << 9 )  /**< \brief Isi signal: ISI_D3 */
#define PIO_PA5B_ISI_D4              ( 1u << 5 )  /**< \brief Isi signal: ISI_D4 */
#define PIO_PD11D_ISI_D5             ( 1u << 11 ) /**< \brief Isi signal: ISI_D5 */
#define PIO_PD12D_ISI_D6             ( 1u << 12 ) /**< \brief Isi signal: ISI_D6 */
#define PIO_PA27D_ISI_D7             ( 1u << 27 ) /**< \brief Isi signal: ISI_D7 */
#define PIO_PD27D_ISI_D8             ( 1u << 27 ) /**< \brief Isi signal: ISI_D8 */
#define PIO_PD28D_ISI_D9             ( 1u << 28 ) /**< \brief Isi signal: ISI_D9 */
#define PIO_PD24D_ISI_HSYNC          ( 1u << 24 ) /**< \brief Isi signal: ISI_HSYNC */
#define PIO_PA24D_ISI_PCK            ( 1u << 24 ) /**< \brief Isi signal: ISI_PCK */
#define PIO_PD25D_ISI_VSYNC          ( 1u << 25 ) /**< \brief Isi signal: ISI_VSYNC */
/* ========== Pio definition for PIOA peripheral ========== */
#define PIO_PA21X1_AFE0_AD1          ( 1u << 21 ) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2          ( 1u << 21 ) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA3X1_PIODC0             ( 1u << 3 )  /**< \brief Pioa signal: PIODC0 */
#define PIO_PA10X1_PIODC4            ( 1u << 10 ) /**< \brief Pioa signal: PIODC4 */
#define PIO_PA12X1_PIODC6            ( 1u << 12 ) /**< \brief Pioa signal: PIODC6 */
#define PIO_PA13X1_PIODC7            ( 1u << 13 ) /**< \brief Pioa signal: PIODC7 */
#define PIO_PA22X1_PIODCCLK          ( 1u << 22 ) /**< \brief Pioa signal: PIODCCLK */
#define PIO_PA4X1_WKUP3              ( 1u << 4 )  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA4X1_PIODC1             ( 1u << 4 )  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA5X1_WKUP4              ( 1u << 5 )  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA5X1_PIODC2             ( 1u << 5 )  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA9X1_WKUP6              ( 1u << 9 )  /**< \brief Pioa signal: WKUP6/PIODC3 */
#define PIO_PA9X1_PIODC3             ( 1u << 9 )  /**< \brief Pioa signal: WKUP6/PIODC3 */
#define PIO_PA11X1_WKUP7             ( 1u << 11 ) /**< \brief Pioa signal: WKUP7/PIODC5 */
#define PIO_PA11X1_PIODC5            ( 1u << 11 ) /**< \brief Pioa signal: WKUP7/PIODC5 */
#define PIO_PA14X1_WKUP8             ( 1u << 14 ) /**< \brief Pioa signal: WKUP8/PIODCEN1 */
#define PIO_PA14X1_PIODCEN1          ( 1u << 14 ) /**< \brief Pioa signal: WKUP8/PIODCEN1 */
/* ========== Pio definition for PMC peripheral ========== */
#define PIO_PA6B_PCK0                ( 1u << 6 )  /**< \brief Pmc signal: PCK0 */
#define PIO_PB12D_PCK0               ( 1u << 12 ) /**< \brief Pmc signal: PCK0 */
#define PIO_PB13B_PCK0               ( 1u << 13 ) /**< \brief Pmc signal: PCK0 */
#define PIO_PA17B_PCK1               ( 1u << 17 ) /**< \brief Pmc signal: PCK1 */
#define PIO_PA21B_PCK1               ( 1u << 21 ) /**< \brief Pmc signal: PCK1 */
#define PIO_PA3C_PCK2                ( 1u << 3 )  /**< \brief Pmc signal: PCK2 */
#define PIO_PA18B_PCK2               ( 1u << 18 ) /**< \brief Pmc signal: PCK2 */
#define PIO_PA31B_PCK2               ( 1u << 31 ) /**< \brief Pmc signal: PCK2 */
#define PIO_PB3B_PCK2                ( 1u << 3 )  /**< \brief Pmc signal: PCK2 */
#define PIO_PD31C_PCK2               ( 1u << 31 ) /**< \brief Pmc signal: PCK2 */
/* ========== Pio definition for PWM0 peripheral ========== */
#define PIO_PA10B_PWMC0_PWMEXTRG0    ( 1u << 10 ) /**< \brief Pwm0 signal: PWMC0_PWMEXTRG0 */
#define PIO_PA22B_PWMC0_PWMEXTRG1    ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWMEXTRG1 */
#define PIO_PA9C_PWMC0_PWMFI0        ( 1u << 9 )  /**< \brief Pwm0 signal: PWMC0_PWMFI0 */
#define PIO_PD8B_PWMC0_PWMFI1        ( 1u << 8 )  /**< \brief Pwm0 signal: PWMC0_PWMFI1 */
#define PIO_PD9B_PWMC0_PWMFI2        ( 1u << 9 )  /**< \brief Pwm0 signal: PWMC0_PWMFI2 */
#define PIO_PA0A_PWMC0_PWMH0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA11B_PWMC0_PWMH0        ( 1u << 11 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA23B_PWMC0_PWMH0        ( 1u << 23 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PB0A_PWMC0_PWMH0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PD11B_PWMC0_PWMH0        ( 1u << 11 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PD20A_PWMC0_PWMH0        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA2A_PWMC0_PWMH1         ( 1u << 2 )  /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA12B_PWMC0_PWMH1        ( 1u << 12 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA24B_PWMC0_PWMH1        ( 1u << 24 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PB1A_PWMC0_PWMH1         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PD21A_PWMC0_PWMH1        ( 1u << 21 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA13B_PWMC0_PWMH2        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PA25B_PWMC0_PWMH2        ( 1u << 25 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PB4B_PWMC0_PWMH2         ( 1u << 4 )  /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PC19B_PWMC0_PWMH2        ( 1u << 19 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PD22A_PWMC0_PWMH2        ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PA7B_PWMC0_PWMH3         ( 1u << 7 )  /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA14B_PWMC0_PWMH3        ( 1u << 14 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA17C_PWMC0_PWMH3        ( 1u << 17 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PC13B_PWMC0_PWMH3        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PC21B_PWMC0_PWMH3        ( 1u << 21 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PD23A_PWMC0_PWMH3        ( 1u << 23 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA1A_PWMC0_PWML0         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PA19B_PWMC0_PWML0        ( 1u << 19 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PB5B_PWMC0_PWML0         ( 1u << 5 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PC0B_PWMC0_PWML0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PD10B_PWMC0_PWML0        ( 1u << 10 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PD24A_PWMC0_PWML0        ( 1u << 24 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PA20B_PWMC0_PWML1        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PB12A_PWMC0_PWML1        ( 1u << 12 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PC1B_PWMC0_PWML1         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PC18B_PWMC0_PWML1        ( 1u << 18 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PD25A_PWMC0_PWML1        ( 1u << 25 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PA16C_PWMC0_PWML2        ( 1u << 16 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PA30A_PWMC0_PWML2        ( 1u << 30 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PB13A_PWMC0_PWML2        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PC2B_PWMC0_PWML2         ( 1u << 2 )  /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PC20B_PWMC0_PWML2        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PD26A_PWMC0_PWML2        ( 1u << 26 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PA15C_PWMC0_PWML3        ( 1u << 15 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC3B_PWMC0_PWML3         ( 1u << 3 )  /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC15B_PWMC0_PWML3        ( 1u << 15 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC22B_PWMC0_PWML3        ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PD27A_PWMC0_PWML3        ( 1u << 27 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
/* ========== Pio definition for PWM1 peripheral ========== */
#define PIO_PA30B_PWMC1_PWMEXTRG0    ( 1u << 30 ) /**< \brief Pwm1 signal: PWMC1_PWMEXTRG0 */
#define PIO_PA18A_PWMC1_PWMEXTRG1    ( 1u << 18 ) /**< \brief Pwm1 signal: PWMC1_PWMEXTRG1 */
#define PIO_PA21C_PWMC1_PWMFI0       ( 1u << 21 ) /**< \brief Pwm1 signal: PWMC1_PWMFI0 */
#define PIO_PA26D_PWMC1_PWMFI1       ( 1u << 26 ) /**< \brief Pwm1 signal: PWMC1_PWMFI1 */
#define PIO_PA28D_PWMC1_PWMFI2       ( 1u << 28 ) /**< \brief Pwm1 signal: PWMC1_PWMFI2 */
#define PIO_PA12C_PWMC1_PWMH0        ( 1u << 12 ) /**< \brief Pwm1 signal: PWMC1_PWMH0 */
#define PIO_PD1B_PWMC1_PWMH0         ( 1u << 1 )  /**< \brief Pwm1 signal: PWMC1_PWMH0 */
#define PIO_PA14C_PWMC1_PWMH1        ( 1u << 14 ) /**< \brief Pwm1 signal: PWMC1_PWMH1 */
#define PIO_PD3B_PWMC1_PWMH1         ( 1u << 3 )  /**< \brief Pwm1 signal: PWMC1_PWMH1 */
#define PIO_PA31D_PWMC1_PWMH2        ( 1u << 31 ) /**< \brief Pwm1 signal: PWMC1_PWMH2 */
#define PIO_PD5B_PWMC1_PWMH2         ( 1u << 5 )  /**< \brief Pwm1 signal: PWMC1_PWMH2 */
#define PIO_PA8A_PWMC1_PWMH3         ( 1u << 8 )  /**< \brief Pwm1 signal: PWMC1_PWMH3 */
#define PIO_PD7B_PWMC1_PWMH3         ( 1u << 7 )  /**< \brief Pwm1 signal: PWMC1_PWMH3 */
#define PIO_PA11C_PWMC1_PWML0        ( 1u << 11 ) /**< \brief Pwm1 signal: PWMC1_PWML0 */
